bivex/ArchC/tests/esp32/esp32_arch_ref.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  _ESP32_ARCH_REF_H
#define  _ESP32_ARCH_REF_H

#include  "esp32_parms.H"
#include  "ac_arch_ref.H"
#include  "ac_memport.H"
#include  "ac_reg.H"
#include  "ac_regbank.H"


//!Forward class declaration, needed to compile.
class esp32_arch;

//!ArchC class for model-specific architectural resources.
class esp32_arch_ref : public ac_arch_ref<esp32_parms::ac_word, esp32_parms::ac_Hword> {
public:
 
  //!Program Counter.
  ac_reg<unsigned>& ac_pc;

  //!Processor Id.
  ac_reg<unsigned>& ac_id;

  //!Storage Devices.
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword>& IROM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword>& IRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword>& DRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword>& PSRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword>& DM;
  ac_regbank<16, esp32_parms::ac_word, esp32_parms::ac_Dword>& AR;
  ac_reg<esp32_parms::ac_word>& sar;
  ac_reg<esp32_parms::ac_word>& lcount;
  ac_reg<esp32_parms::ac_word>& lbeg;
  ac_reg<esp32_parms::ac_word>& lend;
  ac_reg<esp32_parms::ac_word>& ps;

  //!Constructor.
   esp32_arch_ref(esp32_arch& arch);

};

#endif  //_ESP32_ARCH_REF_H
